"""Задание 1"""
from unicodedata import digit

"""numb1 = input("Введите первую цифру: ")
numb2 = input("Введите вторую цифру: ")
numb3 = input("Введите третью цифру: ")

result_number = numb1 + numb2 + numb3

result = int(result_number)

print(result)"""

"""Задание 2"""

"""number = input("Введите четырехзначаное число:")

if len(number) != 4 and number.isdigit():
    print("Ошибка! Введите верное число")

else:
    result = 1
for digit in number:
    result *= int(digit)
print("Ответ:" , result)"""

"""Задание 3"""

"""metr = float(input("Введите метры:"))

dacimeter = metr * 10
centimetre = metr * 100
millimeter = metr * 1000
mile = metr / 1609.34

print(f"В {metr} метров:")
print(f"{dacimeter} дациметров")
print(f"{centimetre} сантиметров")
print(f"{millimeter} миллиметров")
print(f"{mile} миль")"""

"""Задание 4"""

"""footing = float(input("Ввдеите длину основания:"))
height = float(input("Введиет высоту:"))

square = 0.5 * footing * height

print(f"{square}")"""

"""Задание 5"""

"""number = input("Введите четырехзначное число:")

if len(number) != 4:
    print("Ошибка! Введите верное число")
else:
    numbr = number[::-1]

print(numbr)"""